HotRadiationDepot12/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 270.15;

boundaryField
{
    DepotCelling12
    {
        type            fixedValue;
        value           uniform 270.15;  // -3 celsius
    }

    DepotWall12
    {
        type            zeroGradient;
    }

    DepotFloor12
    {
        type            fixedValue;
        value           uniform 270.15;  // -3 celsius
    }

    DepotPanel12
    {
        type            fixedValue;
        value           uniform   353.15;  // 60 celsius
    }

}

// ************************************************************************* //
