HotRadiationDepot12/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    DepotCelling12
    {
        type            calculated;
        value           $internalField;
    }
    DepotWall12
    {
        type            calculated;
        value           $internalField;
    }
    DepotFloor12
    {
        type            calculated;
        value           $internalField;
    }
    DepotPanel12
    {
        type            calculated;
        value           $internalField;
    }
    
}

// ************************************************************************* //
