HotRadiationDepot12/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication surfaceFeatures
runApplication snappyHexMesh -overwrite
runApplication decomposePar -force -latestTime
runParallel $application
runApplication reconstructPar

#------------------------------------------------------------------------------
