HotRadiationDepot12/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
surfaces
(
    "DepotCelling12.stl"
    "DepotWall12.stl"
    "DepotFloor12.stl"
    "DepotPanel12.stl"
);

includedAngle 30;
// Settings for the feature extraction
extractionMethod    extractFromSurface;

extractFromSurfaceCoeffs
{
    // The angle to capture features. 30 is a good starting point.
    includedAngle       30;
}

// Write the results to .eMesh files in the constant/triSurface/ directory
writeObj                false;
